'''
1 Вычислить число π c заданной точностью d

*Пример:*

- при $d = 0.001, π = 3.141.$    $10^{-1} ≤ d ≤10^{-10}$

'''

# ряд Нилаканта: π = 3 + 4/(2*3*4) - 4/(4*5*6) + 4/(6*7*8) - 4/(8*9*10) + 4/(10*11*12) - (4/(12*13*14)


def pi_(d):
    n = 0
    i = 2
    p = 3
    p1 = 0
    p2 = 0
    while n < 1000:
        p1 = 4/(i*(i+1)*(i+2))
        p2 = -4/((i+2)*(i+3)*(i+4))
        i += 4
        p = p + p1 + p2
        n += 1
    d1 = str(d)
    s = len(d1) - d1.index('.') - 1
    return round(p, s)


print(pi_(0.001))
