'''
5 Реализуйте алгоритм перемешивания списка.
'''
import random

n = input("Введите значения: ").split()
random.shuffle(n)
print(n)
